# PointAdaptiveOrientationType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointAdaptiveOrientationType Property
ParameterTypeId Class See Also
---
"Orients to"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointAdaptiveOrientationType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointAdaptiveOrientationType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointAdaptiveOrientationType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace